In [83]:
import pandas as pd
import numpy as np

In [84]:
dates = pd.date_range('20130101', periods=6)

In [85]:
df = pd.DataFrame(np.arange(24).reshape((6, 4)), index=dates,
     columns=['A', 'B', 'C', 'D'])

In [86]:
# 按照索引来进行修改
df.iloc[2, 2] = 1111

In [87]:
df

             A   B     C   D
2013-01-01   0   1     2   3
2013-01-02   4   5     6   7
2013-01-03   8   9  1111  11
2013-01-04  12  13    14  15
2013-01-05  16  17    18  19
2013-01-06  20  21    22  23

In [88]:
# 按照标签来进行修改
df.loc['20130101', 'B'] = 222

In [89]:
df

             A    B     C   D
2013-01-01   0  222     2   3
2013-01-02   4    5     6   7
2013-01-03   8    9  1111  11
2013-01-04  12   13    14  15
2013-01-05  16   17    18  19
2013-01-06  20   21    22  23

In [90]:
# 只将A列中的数大于4的数全置为0
df.A[df.A > 4] = 0

In [91]:
df

            A    B     C   D
2013-01-01  0  222     2   3
2013-01-02  4    5     6   7
2013-01-03  0    9  1111  11
2013-01-04  0   13    14  15
2013-01-05  0   17    18  19
2013-01-06  0   21    22  23

In [92]:
# 只将A列中的数等于4的数全置为0
df[df.A == 4] = 0

In [93]:
df

            A    B     C   D
2013-01-01  0  222     2   3
2013-01-02  0    0     0   0
2013-01-03  0    9  1111  11
2013-01-04  0   13    14  15
2013-01-05  0   17    18  19
2013-01-06  0   21    22  23

In [94]:
df

            A    B     C   D
2013-01-01  0  222     2   3
2013-01-02  0    0     0   0
2013-01-03  0    9  1111  11
2013-01-04  0   13    14  15
2013-01-05  0   17    18  19
2013-01-06  0   21    22  23

In [95]:
# 加一列数据,赋值为nan
df['F'] = np.nan

In [96]:
print(df)

            A    B     C   D   F
2013-01-01  0  222     2   3 NaN
2013-01-02  0    0     0   0 NaN
2013-01-03  0    9  1111  11 NaN
2013-01-04  0   13    14  15 NaN
2013-01-05  0   17    18  19 NaN
2013-01-06  0   21    22  23 NaN

In [99]:
# 添加一个序列，保持行索引相同，这样才能相融合
df['E'] = pd.Series([1, 2, 3, 4 ,5, 6],
                   index=pd.date_range('20130101', periods = 6))

In [100]:
df

            A    B     C   D   F  E
2013-01-01  0  222     2   3 NaN  1
2013-01-02  0    0     0   0 NaN  2
2013-01-03  0    9  1111  11 NaN  3
2013-01-04  0   13    14  15 NaN  4
2013-01-05  0   17    18  19 NaN  5
2013-01-06  0   21    22  23 NaN  6